llm/step_37_flash/b200/bench/bench_sharegpt_mid.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] `torch_dtype` is deprecated! Use `dtype` instead!
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31008, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='stepfun-ai/Step-3.7-Flash-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/step_37_flash/b200/bench/sharegpt_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31008/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31008, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='/data/bbuf/kda-pilot/llm/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', model='stepfun-ai/Step-3.7-Flash-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=8, sharegpt_context_len=8192, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/step_37_flash/b200/bench/sharegpt_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 10715
#Output tokens: 256
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  9.22      
Total input tokens:                      10715     
Total input text tokens:                 10715     
Total generated tokens:                  256       
Total generated tokens (retokenized):    239       
Request throughput (req/s):              3.47      
Input token throughput (tok/s):          1161.99   
Output token throughput (tok/s):         27.76     
Peak output token throughput (tok/s):    32.00     
Peak concurrent requests:                32        
Total token throughput (tok/s):          1189.75   
Concurrency:                             31.97     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   9212.32   
Median E2E Latency (ms):                 9212.29   
P90 E2E Latency (ms):                    9212.99   
P99 E2E Latency (ms):                    9213.63   
---------------Time to First Token----------------
Mean TTFT (ms):                          2564.33   
Median TTFT (ms):                        2504.58   
P99 TTFT (ms):                           3461.17   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          949.71    
Median TPOT (ms):                        958.23    
P99 TPOT (ms):                           1052.93   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           962.60    
Median ITL (ms):                         956.37    
P95 ITL (ms):                            964.43    
P99 ITL (ms):                            964.45    
Max ITL (ms):                            1916.80   
==================================================